---
kind: property
id: P:Autodesk.Revit.DB.Visual.Water.WaterBumpAmount
source: html/4515aa55-c132-36fc-9de9-73ae31f5eefa.htm
---
# Autodesk.Revit.DB.Visual.Water.WaterBumpAmount Property

The property labeled "Wave Height" from the "Water" schema.

## Syntax (C#)
```csharp
public static string WaterBumpAmount { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 5".